app/controllers/shifts_controller.rb

  def index
    @shifts = Shift.all
---
SELECT `shifts`.* FROM `shifts`

  def show
    @shift = Shift.find(params[:id])
---
SELECT `shifts`.* FROM `shifts` WHERE `shifts`.`id` = 2 LIMIT 1

  def new
    @shift = Shift.new
    templates = Template.all
---
SELECT `templates`.* FROM `templates`

  def edit
    @shift = Shift.find(params[:id])
    templates = Template.all
---
SELECT `shifts`.* FROM `shifts` WHERE `shifts`.`id` = 2 LIMIT 1
SELECT `templates`.* FROM `templates`

  def create
    @shift = Shift.new(params[:shift])

    respond_to do |format|
      if @shift.save
---
INSERT INTO `shifts` (`canceled`, `created_at`, `date`, `end`, `start`, `template_id`, `updated_at`) VALUES (0, '2012-02-04 03:51:43', '2012-02-07', 730, 600, 11, '2012-02-04 03:51:43')

  def destroy
    @shift = Shift.find(params[:id])
    @shift.destroy
---
SELECT `shifts`.* FROM `shifts` WHERE `shifts`.`id` = 1 LIMIT 1
DELETE FROM `shifts` WHERE `shifts`.`id` = 1