app/controllers/templates_controller.rb

SELECT `templates`.* FROM `templates` ORDER BY day, start
SELECT `templates`.* FROM `templates`
---
  def index
    @templates = Template.order(:day,:start)
    @temp = { :Monday => [],
              :Tuesday => [],
              :Wednesday => [],
              :Thursday => [],
              :Friday => [],
              :Saturday => [],
              :Sunday => []}
   @templates.each do |item|

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 5 LIMIT 1
---
  def show
    @template = Template.find(params[:id])

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 11 LIMIT 1
---
  def edit
    @template = Template.find(params[:id])

SELECT COUNT(*) FROM `templates` WHERE `templates`.`day` = 'monday' AND (`templates`.`start` BETWEEN 200 AND 400)
INSERT INTO `templates` (`created_at`, `day`, `end`, `start`, `updated_at`) VALUES ('2012-02-03 20:01:40', '---\n- Monday\n- \'1\'\n', NULL, NULL, '2012-02-03 20:01:40')
---
  def create
    if params[:days]
      flash[:warning] = ""
      params[:days].each do |key, value|
        if value == "1"
          s = Integer(Time.parse(params[:template][:start]).strftime("%k%M"))
          e = Integer(Time.parse(params[:template][:end]).strftime("%k%M"))

          if Template.where(:day => key, :start => s..e).empty? and Template.where(:day => key, :end => s..e).empty?
            @template = Template.new(:day => key, :start => s, :end => e)
            @template.save

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 29 LIMIT 1
UPDATE `templates` SET `day` = 'Monday', `updated_at` = '2012-02-28 00:48:40' WHERE `templates`.`id` = 29
---
  def update
    @template = Template.find(params[:id])

    respond_to do |format|
      if @template.update_attributes(params[:template])

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 16 LIMIT 1
DELETE FROM `templates` WHERE `templates`.`id` = 16
---
  def destroy
    @template = Template.find(params[:id])
    @template.destroy