app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `fname`, `lastlog`, `lname`, `opt_out`, `password_hash`, `password_salt`, `phone`, `updated_at`, `username`) VALUES ('2012-02-29 06:55:29', 'jscala1@swarthmore.edu', 'Jackie', NULL, 'Scala', 1, '$2a$10$RDsVbK78xDS5vJ7BoEObUurCzBhbJS9T3OgsMMDpzbaS5PoOribyS', '$2a$10$RDsVbK78xDS5vJ7BoEObUu', '6105555555', '2012-02-29 06:55:29', 'jscala1')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$XOTsdQN0w1NHD8e2YZ7ui.', `password_hash` = '$2a$10$XOTsdQN0w1NHD8e2YZ7ui.0SEfAQD41yjXBZJmdZJIdWkEdXUKPli', `updated_at` = '2012-02-05 01:48:59' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])